Masmiseim36/nxpSDK/boards/twrkl82z72m/project_template/pin_mux.c
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MKL82Z128xxx7
package_id: MKL82Z128VMC7
mcu_data: ksdk2_0
processor_version: 4.0.0
board: TWR-KL82Z72M
pin_labels:
- {pin_num: D8, pin_signal: ADC0_SE15/TSI0_CH14/PTC1/LLWU_P6/SPI0_PCS3/LPUART1_RTS_b/TPM0_CH0/FXIO0_D13, label: 'J13[A40]/J13[A67]/J13[B21]/J7[14]/J12[15]/U2[20]/SDRAM_A21/ELECTRODE10',
  identifier: SDRAM_A21}
- {pin_num: C3, pin_signal: PTD2/LLWU_P13/SPI0_SOUT/LPUART2_RX/I2C0_SCL, label: 'J13[A76]/J13[B35]/U2[29]/SW3/SDRAM_A12', identifier: SW3;SDRAM_A12}
- {pin_num: B7, pin_signal: CMP0_IN1/PTC7/SPI0_SIN/USB0_SOF_OUT/FXIO0_D15, label: 'J13[A72]/J13[B44]/J7[16]/U2[23]/SDRAM_A16', identifier: SDRAM_A16}
- {pin_num: C7, pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/EXTRG_IN/FXIO0_D14, label: 'J13[A71]/J13[B45]/J7[15]/U2[33]/SDRAM_A17', identifier: SDRAM_A17}
- {pin_num: D4, pin_signal: PTD0/LLWU_P12/SPI0_PCS0/LPUART2_RTS_b/FXIO0_D22, label: 'J13[B46]/J13[B63]'}
- {pin_num: A3, pin_signal: PTD4/LLWU_P14/SPI0_PCS1/LPUART0_RTS_b/TPM0_CH4/EWM_IN/SPI1_PCS0, label: 'J13[A78]/J13[B47]/U2[31]/SDRAM_A10', identifier: SDRAM_A10}
- {pin_num: D3, pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/LPUART2_CTS_b/FXIO0_D23, label: 'J13[B48]/J13[B64]'}
- {pin_num: C6, pin_signal: PTC10/I2C1_SCL/FXIO0_D18, label: 'J13[A75]/J13[B50]/U2[26]/SDRAM_A13', identifier: SDRAM_A13}
- {pin_num: C5, pin_signal: PTC11/LLWU_P11/I2C1_SDA/FXIO0_D19, label: 'J13[B51]/J13[B71]'}
- {pin_num: B3, pin_signal: PTD3/SPI0_SIN/LPUART2_TX/I2C0_SDA, label: 'J13[A77]/J13[B52]/U2[30]/SDRAM_A11', identifier: SDRAM_A11}
- {pin_num: D10, pin_signal: PTB10/SPI1_PCS0/FXIO0_D4, label: 'J13[B57]/J13[B70]/J7[5]/U2[7]/SDRAM_D19', identifier: SDRAM_D19}
- {pin_num: E10, pin_signal: PTB9/SPI1_PCS1, label: 'J13[B58]/U2[8]/SDRAM_D20', identifier: SDRAM_D20}
- {pin_num: C11, pin_signal: PTB5/EMVSIM1_CLK, label: 'J13[B59]/J13[C58]/J35[C3]/PTB5_EMVSIM1_CLK', identifier: SMARTCARD_CLOCK}
- {pin_num: K9, pin_signal: PTA14/SPI0_PCS0/LPUART0_TX/FXIO0_D20, label: 'J13[A42]/J13[A58]/J13[B60]'}
- {pin_num: L8, pin_signal: PTA13/LLWU_P4/TPM1_CH1/FXIO0_D19, label: 'J13[A23]/J13[B61]/J7[20]'}
- {pin_num: K8, pin_signal: PTA12/TPM1_CH0/FXIO0_D18, label: 'J13[A25]/J13[B62]/J7[19]'}
- {pin_num: D9, pin_signal: TSI0_CH11/PTB18/TPM2_CH0/FXIO0_D6, label: 'J13[A34]/J13[B66]/J7[7]/J12[12]/ELECTRODE7'}
- {pin_num: E9, pin_signal: TSI0_CH10/PTB17/SPI1_SIN/LPUART0_TX/TPM_CLKIN1/EWM_OUT_b, label: 'J13[B67]/J12[11]/BRD_PAD1/U2[2]/SDRAM_D16/ELECTRODE6', identifier: SDRAM_D16;TSI_ELECTRODE_2}
- {pin_num: B10, pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/LPUART0_RX/TPM_CLKIN0/EWM_IN, label: 'J13[B68]/J12[10]/BRD_PAD2/U2[4]/SDRAM_D17/ELECTRODE5', identifier: SDRAM_D17;TSI_ELECTRODE_1}
- {pin_num: C10, pin_signal: PTB11/SPI1_SCK/FXIO0_D5, label: 'J13[B69]/J7[6]/U2[5]/SDRAM_D18', identifier: SDRAM_D18}
- {pin_num: C9, pin_signal: TSI0_CH12/PTB19/TPM2_CH1/FXIO0_D7, label: 'J13[A33]/J13[B72]/J7[8]/J12[13]/ELECTRODE8'}
- {pin_num: F10, pin_signal: PTB20/CMP0_OUT/FXIO0_D8, label: 'J13[B73]/J7[9]/U2[53]/SDRAM_D31', identifier: SDRAM_D31}
- {pin_num: F9, pin_signal: PTB21/FXIO0_D9, label: 'J13[B74]/J7[10]/U2[51]/SDRAM_D30', identifier: SDRAM_D30}
- {pin_num: F8, pin_signal: PTB22/FXIO0_D10, label: 'J13[B75]/U2[50]/SDRAM_D29', identifier: SDRAM_D29}
- {pin_num: E8, pin_signal: PTB23/SPI0_PCS5/FXIO0_D11, label: 'J13[B76]/U2[48]/SDRAM_D28', identifier: SDRAM_D28}
- {pin_num: B6, pin_signal: PTC12/TPM_CLKIN0, label: 'J13[B77]/U2[47]/SDRAM_D27', identifier: SDRAM_D27}
- {pin_num: A6, pin_signal: PTC13/TPM_CLKIN1, label: 'J13[B78]/U2[45]/SDRAM_D26', identifier: SDRAM_D26}
- {pin_num: A5, pin_signal: PTC14/FXIO0_D20, label: 'J13[B79]/U2[44]/SDRAM_D25', identifier: SDRAM_D25}
- {pin_num: B5, pin_signal: PTC15/FXIO0_D21, label: 'J13[B80]/U2[42]/SDRAM_D24', identifier: SDRAM_D24}
- {pin_num: A10, pin_signal: PTD8/LLWU_P24/I2C0_SCL/FXIO0_D24, label: 'J13[A7]/U1[11]/U3[8]/U26[4]/I2C_SCL', identifier: I2C_SCL}
- {pin_num: A9, pin_signal: PTD9/I2C0_SDA/FXIO0_D25, label: 'J13[A8]/U1[12]/U3[7]/U26[6]/I2C_SDA', identifier: I2C_SDA}
- {pin_num: C8, pin_signal: ADC0_SE4b/TSI0_CH15/PTC2/SPI0_PCS2/LPUART1_CTS_b/TPM0_CH1, label: 'J13[A9]/J13[A68]/J13[A39]/J12[16]/U2[35]/SDRAM_A20/ELECTRODE11', identifier: SDRAM_A20}
- {pin_num: B2, pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/LPUART0_RX/SPI1_SOUT, label: 'J13[A11]/J13[A80]/TP2/POT_5K', identifier: ADC_POT}
- {pin_num: H10, pin_signal: PTA17/SPI0_SIN/LPUART0_RTS_b/FXIO0_D23, label: 'J13[A21]'}
- {pin_num: K7, pin_signal: PTA5/USB0_CLKIN/TPM0_CH2/FXIO0_D15, label: 'J13[A22]'}
- {pin_num: L9, pin_signal: PTA15/SPI0_SCK/LPUART0_RX/FXIO0_D21, label: 'J13[A24]/J13[A41]'}
- {pin_num: A2, pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/LPUART0_CTS_b/TPM0_CH5/EWM_OUT_b/SPI1_SCK, label: 'J13[A27]/J13[A79]/U2[32]/ADC0_SE6b/SDRAM_A9', identifier: BAT_OUT;SDRAM_A9}
- {pin_num: G10, pin_signal: ADC0_SE9/TSI0_CH6/PTB1/I2C0_SDA/TPM1_CH1/FXIO0_D1, label: 'J13[A28]/J13[A37]/J7[2]/J12[7]/U2[18]/SDRAM_RAS/ELECTRODE2', identifier: SDRAM_RAS}
- {pin_num: L1, pin_signal: ADC0_DM1, label: 'J13[A29]'}
- {pin_num: L2, pin_signal: ADC0_DP1, label: 'J13[A30]'}
- {pin_num: K4, pin_signal: DAC0_OUT/ADC0_SE23, label: 'J13[A32]'}
- {pin_num: G11, pin_signal: ADC0_SE8/TSI0_CH0/PTB0/LLWU_P5/I2C0_SCL/TPM1_CH0/FXIO0_D0, label: 'J13[A38]/J7[1]/J12[5]/U2[17]/SDRAM_CAS/ELECTRODE1', identifier: SDRAM_CAS}
- {pin_num: B8, pin_signal: PTC3/LLWU_P7/SPI0_PCS1/LPUART1_RX/TPM0_CH2/CLKOUT, label: 'J13[A43]/J6[2]/U2[38]/LPUART1_RX/SDRAM_CLK', identifier: DEBUG_UART_RX;SDRAM_CLKOUT}
- {pin_num: A8, pin_signal: PTC4/LLWU_P8/SPI0_PCS0/LPUART1_TX/TPM0_CH3, label: 'J13[A44]/J13[A69]/J8[2]/U2[22]/LPUART1_TX/SDRAM_A19', identifier: DEBUG_UART_TX;SDRAM_A19}
- {pin_num: H1, pin_signal: USB0_DM, label: 'J13[A54]/J19[2]', identifier: USB_DN}
- {pin_num: H2, pin_signal: USB0_DP, label: 'J13[A55]/J19[3]', identifier: USB_DP}
- {pin_num: A1, pin_signal: PTD7/LPUART0_TX/SPI1_SIN, label: 'J13[A56]/U2[37]/SDRAM_CKE', identifier: SDRAM_CKE}
- {pin_num: J10, pin_signal: PTA16/SPI0_SOUT/LPUART0_CTS_b/FXIO0_D22, label: 'J13[A59]'}
- {pin_num: J11, pin_signal: RESET_b, label: 'J13[A62]/J12[20]/J11[10]'}
- {pin_num: B9, pin_signal: ADC0_SE14/TSI0_CH13/PTC0/SPI0_PCS4/EXTRG_IN/USB0_SOF_OUT/FXIO0_D12, label: 'J13[A66]/J12[14]/U2[21]/SDRAM_A22/ELECTRODE9', identifier: SDRAM_A22}
- {pin_num: D7, pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/LPTMR1_ALT2/CMP0_OUT/TPM0_CH2, label: 'J13[A70]/U2[34]/SDRAM_A18', identifier: SDRAM_A18}
- {pin_num: A7, pin_signal: CMP0_IN2/PTC8/FXIO0_D16, label: 'J13[A73]/U2[24]/SDRAM_A15', identifier: SDRAM_A15}
- {pin_num: D6, pin_signal: CMP0_IN3/PTC9/FXIO0_D17, label: 'J13[A74]/U2[25]/SDRAM_A14', identifier: SDRAM_A14}
- {pin_num: H7, pin_signal: PTA11/LLWU_P23/TPM2_CH1/FXIO0_D17, label: 'J13[C7]/J7[18]'}
- {pin_num: J9, pin_signal: PTA10/LLWU_P22/TPM2_CH0/EMVSIM1_VCCEN/FXIO0_D16, label: 'J13[C8]/J7[17]'}
- {pin_num: E11, pin_signal: PTB7/EMVSIM1_PD, label: 'J13[C22]/J35[SW1]/U2[11]/SDRAM_D22/PTB7_EMVSIM1_PD', identifier: SDRAM_D22;SMARTCARD_PD}
- {pin_num: F11, pin_signal: PTB6/EMVSIM1_VCCEN, label: 'J13[C25]/U2[13]/U7[B2]/SDRAM_D23/PTB6_EMVSIM1_VCCEN', identifier: SDRAM_D23;SMARTCARD_VCCEN}
- {pin_num: J5, pin_signal: NC138, label: 'J13[C39]/J1[2]/TAMPER1'}
- {pin_num: H5, pin_signal: NC136, label: 'J13[C40]/J1[5]/TAMPER4'}
- {pin_num: D11, pin_signal: PTB8/EMVSIM1_RST, label: 'J13[C59]/J35[C2]/U2[10]/SDRAM_D21/PTB8_EMVSIM1_RST', identifier: SDRAM_D21;SMARTCARD_RST}
- {pin_num: B11, pin_signal: PTB4/EMVSIM1_IO, label: 'J13[C61]/J35[C7]/PTB4_EMVSIM1_IO', identifier: SMARTCARD_IO}
- {pin_num: G9, pin_signal: ADC0_SE12/TSI0_CH7/PTB2/I2C0_SCL/LPUART0_RTS_b/FXIO0_D2, label: 'J7[3]/J12[8]/U2[16]/SDRAM_WE/ELECTRODE3', identifier: SDRAM_WE}
- {pin_num: L7, pin_signal: TSI0_CH1/PTA0/LPUART0_CTS_b/TPM0_CH5/FXIO0_D10/EMVSIM0_CLK/SWD_CLK, label: 'J7[11]/J11[4]/JTAG_TCLK'}
- {pin_num: J7, pin_signal: TSI0_CH3/PTA2/LPUART0_TX/FXIO0_D12/EMVSIM0_PD, label: 'J7[13]/J11[6]/JTAG_TDO'}
- {pin_num: G8, pin_signal: ADC0_SE13/TSI0_CH8/PTB3/I2C0_SDA/LPUART0_CTS_b/FXIO0_D3, label: 'J7[4]/J12[9]/U2[19]/SDRAM_CS0/ELECTRODE4', identifier: SDRAM_CS0}
- {pin_num: H8, pin_signal: TSI0_CH2/PTA1/LPUART0_RX/FXIO0_D11/EMVSIM0_IO, label: 'J7[12]/J11[8]/JTAG_TDI'}
- {pin_num: J8, pin_signal: TSI0_CH5/PTA4/LLWU_P3/TPM0_CH1/FXIO0_D14/EMVSIM0_VCCEN/NMI_b, label: 'J12[3]/SW2/ELECTRODE0', identifier: SW2}
- {pin_num: K2, pin_signal: ADC0_DP0, label: 'J12[17]/TWRPI_ID0'}
- {pin_num: K1, pin_signal: ADC0_DM0, label: 'J12[18]/TWRPI_ID1'}
- {pin_num: H9, pin_signal: TSI0_CH4/PTA3/LPUART0_RTS_b/TPM0_CH0/FXIO0_D13/EMVSIM0_RST/SWD_DIO, label: 'J11[2]/JTAG_TMS'}
- {pin_num: C4, pin_signal: PTC17, label: 'U2[39]/SDRAM_DQM3', identifier: SDRAM_DQM3}
- {pin_num: D5, pin_signal: PTC16, label: 'U2[15]/SDRAM_DQM2', identifier: SDRAM_DQM2}
- {pin_num: E3, pin_signal: PTD11/LLWU_P25/FXIO0_D27, label: 'D1[C]/RED', identifier: LED_RED}
- {pin_num: F4, pin_signal: PTD12/FXIO0_D28, label: 'D2[C]/GREEN', identifier: LED_GREEN}
- {pin_num: G3, pin_signal: PTD13/FXIO0_D29, label: 'D3[C]/BLUE', identifier: LED_BLUE}
- {pin_num: G4, pin_signal: PTD14/FXIO0_D30, label: 'D13[C]/LED_GRN', identifier: LED1_ELECTRODE}
- {pin_num: H4, pin_signal: PTD15/FXIO0_D31, label: 'D14[C]/LED2_ELECTRODE', identifier: LED2_ELECTRODE}
- {pin_num: C1, pin_signal: PTE2/LLWU_P1/SPI1_SOUT/LPUART1_CTS_b/QSPI0A_DATA0/SPI1_SCK, label: 'U23[5]/QSPI0A_DATA0', identifier: QSPI0A_DATA0}
- {pin_num: D2, pin_signal: PTE3/SPI1_PCS2/LPUART1_RTS_b/QSPI0A_DATA2/SPI1_SOUT, label: 'U23[3]/QSPI0A_DATA2', identifier: QSPI0A_DATA2}
- {pin_num: B1, pin_signal: PTE0/SPI1_PCS1/LPUART1_TX/QSPI0A_DATA3/I2C1_SDA/RTC_CLKOUT, label: 'U23[7]/QSPI0A_DATA3', identifier: QSPI0A_DATA3}
- {pin_num: E2, pin_signal: PTE5/SPI1_PCS0/QSPI0A_SS0_B/USB0_SOF_OUT, label: 'U23[1]/QSPI0A_SS0', identifier: QSPI0A_SS0}
- {pin_num: C2, pin_signal: PTE1/LLWU_P0/SPI1_SCK/LPUART1_RX/QSPI0A_SCLK/I2C1_SCL/SPI1_SIN, label: 'U23[6]/QSPI0A_SCLK', identifier: QSPI0A_SCLK}
- {pin_num: D1, pin_signal: PTE4/LLWU_P2/SPI1_SIN/QSPI0A_DATA1, label: 'U23[2]/QSPI0A_DATA1', identifier: QSPI0A_DATA1}
- {pin_num: G2, pin_signal: PTE10/LLWU_P18/QSPI0B_DATA1, label: 'U22[2]/QSPI0B_DATA1', identifier: QSPI0B_DATA1}
- {pin_num: F2, pin_signal: PTE8/QSPI0B_DATA0, label: 'U22[5]/QSPI0B_DATA0', identifier: QSPI0B_DATA0}
- {pin_num: F1, pin_signal: PTE9/LLWU_P17/QSPI0B_DATA2, label: 'U22[3]/QSPI0B_DATA2', identifier: QSPI0B_DATA2}
- {pin_num: E1, pin_signal: PTE6/LLWU_P16/SPI1_PCS3/QSPI0B_DATA3, label: 'U22[7]/QSPI0B_DATA3', identifier: QSPI0B_DATA3}
- {pin_num: G1, pin_signal: PTE11/QSPI0B_SS0_B/QSPI0A_DQS, label: 'U22[1]/QSPI0B_SS0', identifier: QSPI0B_SS0}
- {pin_num: F3, pin_signal: PTE7/QSPI0B_SCLK/QSPI0A_SS1_B, label: 'U22[6]/QSPI0B_SCLK', identifier: QSPI0B_SCLK}
- {pin_num: A4, pin_signal: PTC19, label: 'J28[2]/U5[3]/KL80_USB_EN', identifier: USB_PWR_EN}
- {pin_num: H11, pin_signal: PTA29, label: 'U5[6]/Q1[3]', identifier: USB_PWR_MON}
- {pin_num: B4, pin_signal: PTC18, label: 'J18[2]/U5[4]/KL80_USB_FLGA_B', identifier: USB_FLGA}
- {pin_num: L11, pin_signal: EXTAL0/PTA18/TPM_CLKIN0, label: 'Y1[3]/EXTAL0', identifier: EXTAL0}
- {pin_num: K11, pin_signal: XTAL0/PTA19/TPM_CLKIN1/LPTMR0_ALT1/LPTMR1_ALT1, label: 'Y1[1]/XTAL0', identifier: XTAL0}
- {pin_num: K5, pin_signal: RTC_WAKEUP_B, label: 'J1[1]/TAMPER0'}
- {pin_num: J4, pin_signal: NC135, label: 'J1[3]/TAMPER2'}
- {pin_num: H6, pin_signal: NC33, label: 'J1[4]/TAMPER3'}
- {pin_num: J6, pin_signal: NC134, label: 'J1[6]/TAMPER5'}
- {pin_num: J3, pin_signal: NC137, label: 'J1[7]/TAMPER6'}
- {pin_num: K3, pin_signal: NC139, label: 'J1[8]/TAMPER7'}
- {pin_num: L4, pin_signal: XTAL32, label: 'Y2[1]/XTAL32', identifier: XTAL32}
- {pin_num: L5, pin_signal: EXTAL32, label: 'Y2[2]/EXTAL32', identifier: EXTAL32}
- {pin_num: L3, pin_signal: VREF_OUT/CMP0_IN5/ADC0_SE22, label: TP20/VREF_OUT}
- {pin_num: J1, pin_signal: USB_VDD, label: 'J22[2]/3V3_BRD/MCU_VDD', identifier: USB_VDD}
- {pin_num: G5, pin_signal: VREFH, label: VREFH}
- {pin_num: G6, pin_signal: VREFL, label: VREFL}
- {pin_num: K6, pin_signal: VBAT, label: VBAT}
- {pin_num: E6, pin_signal: VDD63, label: MCU_VDD}
- {pin_num: E7, pin_signal: VDD82, label: MCU_VDD}
- {pin_num: L10, pin_signal: VDD53, label: MCU_VDD}
- {pin_num: F5, pin_signal: VDDA, label: VDDA}
- {pin_num: E5, pin_signal: VDDIO_E6, label: VDDIO_E}
- {pin_num: F6, pin_signal: VSSA, label: VSSA}
- {pin_num: L6, pin_signal: VSS81, label: GND}
- {pin_num: F7, pin_signal: VSS5, label: GND}
- {pin_num: K10, pin_signal: VSS54, label: GND}
- {pin_num: G7, pin_signal: VSS64, label: GND}
- {pin_num: H3, pin_signal: VSS17, label: GND}
- {pin_num: E4, pin_signal: PTD10/FXIO0_D26, label: 'Q4[1]/U30[4]/CHG_EN', identifier: BAT_CHG_EN}
- {pin_num: J2, pin_signal: NC21, label: NC}
- {pin_num: A11, pin_signal: NC133, label: NC}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

