Masmiseim36/nxpSDK/boards/twrkl82z72m/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitQuadSPI_FLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitQuadSPI_FLASHPins(void)
{
    /* PTE Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    const port_pin_config_t QSPI0A_DATA3 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0A_DATA3 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE0 (pin B1) is configured as QSPI0A_DATA3 */
    PORT_SetPinConfig(BOARD_QSPI0A_DATA3_PORT, BOARD_QSPI0A_DATA3_PIN, &QSPI0A_DATA3);

    const port_pin_config_t QSPI0A_SCLK = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Fast slew rate is configured */
                                           kPORT_FastSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Open drain is disabled */
                                           kPORT_OpenDrainDisable,
                                           /* Pin is configured as QSPI0A_SCLK */
                                           kPORT_MuxAlt5,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE1 (pin C2) is configured as QSPI0A_SCLK */
    PORT_SetPinConfig(BOARD_QSPI0A_SCLK_PORT, BOARD_QSPI0A_SCLK_PIN, &QSPI0A_SCLK);

    const port_pin_config_t QSPI0B_DATA1 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0B_DATA1 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE10 (pin G2) is configured as QSPI0B_DATA1 */
    PORT_SetPinConfig(BOARD_QSPI0B_DATA1_PORT, BOARD_QSPI0B_DATA1_PIN, &QSPI0B_DATA1);

    const port_pin_config_t QSPI0B_SS0 = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Pin is configured as QSPI0B_SS0_B */
                                          kPORT_MuxAlt5,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTE11 (pin G1) is configured as QSPI0B_SS0_B */
    PORT_SetPinConfig(BOARD_QSPI0B_SS0_PORT, BOARD_QSPI0B_SS0_PIN, &QSPI0B_SS0);

    const port_pin_config_t QSPI0A_DATA0 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0A_DATA0 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE2 (pin C1) is configured as QSPI0A_DATA0 */
    PORT_SetPinConfig(BOARD_QSPI0A_DATA0_PORT, BOARD_QSPI0A_DATA0_PIN, &QSPI0A_DATA0);

    const port_pin_config_t QSPI0A_DATA2 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0A_DATA2 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE3 (pin D2) is configured as QSPI0A_DATA2 */
    PORT_SetPinConfig(BOARD_QSPI0A_DATA2_PORT, BOARD_QSPI0A_DATA2_PIN, &QSPI0A_DATA2);

    const port_pin_config_t QSPI0A_DATA1 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0A_DATA1 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE4 (pin D1) is configured as QSPI0A_DATA1 */
    PORT_SetPinConfig(BOARD_QSPI0A_DATA1_PORT, BOARD_QSPI0A_DATA1_PIN, &QSPI0A_DATA1);

