Masmiseim36/nxpSDK/boards/twrkl82z72m/project_template/pin_mux.c
    const port_pin_config_t QSPI0A_SS0 = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Pin is configured as QSPI0A_SS0_B */
                                          kPORT_MuxAlt5,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTE5 (pin E2) is configured as QSPI0A_SS0_B */
    PORT_SetPinConfig(BOARD_QSPI0A_SS0_PORT, BOARD_QSPI0A_SS0_PIN, &QSPI0A_SS0);

    const port_pin_config_t QSPI0B_DATA3 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0B_DATA3 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE6 (pin E1) is configured as QSPI0B_DATA3 */
    PORT_SetPinConfig(BOARD_QSPI0B_DATA3_PORT, BOARD_QSPI0B_DATA3_PIN, &QSPI0B_DATA3);

    const port_pin_config_t QSPI0B_SCLK = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Fast slew rate is configured */
                                           kPORT_FastSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Open drain is disabled */
                                           kPORT_OpenDrainDisable,
                                           /* Pin is configured as QSPI0B_SCLK */
                                           kPORT_MuxAlt5,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE7 (pin F3) is configured as QSPI0B_SCLK */
    PORT_SetPinConfig(BOARD_QSPI0B_SCLK_PORT, BOARD_QSPI0B_SCLK_PIN, &QSPI0B_SCLK);

    const port_pin_config_t QSPI0B_DATA0 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0B_DATA0 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE8 (pin F2) is configured as QSPI0B_DATA0 */
    PORT_SetPinConfig(BOARD_QSPI0B_DATA0_PORT, BOARD_QSPI0B_DATA0_PIN, &QSPI0B_DATA0);

    const port_pin_config_t QSPI0B_DATA2 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0B_DATA2 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE9 (pin F1) is configured as QSPI0B_DATA2 */
    PORT_SetPinConfig(BOARD_QSPI0B_DATA2_PORT, BOARD_QSPI0B_DATA2_PIN, &QSPI0B_DATA2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitEMVSIMPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B11, peripheral: EMVSIM1, signal: IO, pin_signal: PTB4/EMVSIM1_IO, slew_rate: fast, open_drain: enable, pull_select: down, pull_enable: disable}
  - {pin_num: C11, peripheral: EMVSIM1, signal: CLK, pin_signal: PTB5/EMVSIM1_CLK, slew_rate: fast, open_drain: disable, pull_select: up, pull_enable: enable}
  - {pin_num: F11, peripheral: EMVSIM1, signal: VCCEN, pin_signal: PTB6/EMVSIM1_VCCEN, identifier: SMARTCARD_VCCEN, slew_rate: fast, open_drain: disable, pull_select: up,
    pull_enable: enable}
  - {pin_num: E11, peripheral: EMVSIM1, signal: PD, pin_signal: PTB7/EMVSIM1_PD, identifier: SMARTCARD_PD, slew_rate: fast, open_drain: disable, pull_select: down,
    pull_enable: disable}
  - {pin_num: D11, peripheral: EMVSIM1, signal: RST, pin_signal: PTB8/EMVSIM1_RST, identifier: SMARTCARD_RST, slew_rate: fast, open_drain: disable, pull_select: up,
    pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

