Masmiseim36/nxpSDK/boards/twrkl82z72m/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitEMVSIMPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitEMVSIMPins(void)
{
    /* PTB Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t SMARTCARD_IO = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is enabled */
                                            kPORT_OpenDrainEnable,
                                            /* Pin is configured as EMVSIM1_IO */
                                            kPORT_MuxAlt2,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTB4 (pin B11) is configured as EMVSIM1_IO */
    PORT_SetPinConfig(BOARD_SMARTCARD_IO_PORT, BOARD_SMARTCARD_IO_PIN, &SMARTCARD_IO);

    const port_pin_config_t SMARTCARD_CLOCK = {/* Internal pull-up resistor is enabled */
                                               kPORT_PullUp,
                                               /* Fast slew rate is configured */
                                               kPORT_FastSlewRate,
                                               /* Passive filter is disabled */
                                               kPORT_PassiveFilterDisable,
                                               /* Open drain is disabled */
                                               kPORT_OpenDrainDisable,
                                               /* Pin is configured as EMVSIM1_CLK */
                                               kPORT_MuxAlt2,
                                               /* Pin Control Register fields [15:0] are not locked */
                                               kPORT_UnlockRegister};
    /* PORTB5 (pin C11) is configured as EMVSIM1_CLK */
    PORT_SetPinConfig(BOARD_SMARTCARD_CLOCK_PORT, BOARD_SMARTCARD_CLOCK_PIN, &SMARTCARD_CLOCK);

    const port_pin_config_t SMARTCARD_VCCEN = {/* Internal pull-up resistor is enabled */
                                               kPORT_PullUp,
                                               /* Fast slew rate is configured */
                                               kPORT_FastSlewRate,
                                               /* Passive filter is disabled */
                                               kPORT_PassiveFilterDisable,
                                               /* Open drain is disabled */
                                               kPORT_OpenDrainDisable,
                                               /* Pin is configured as EMVSIM1_VCCEN */
                                               kPORT_MuxAlt2,
                                               /* Pin Control Register fields [15:0] are not locked */
                                               kPORT_UnlockRegister};
    /* PORTB6 (pin F11) is configured as EMVSIM1_VCCEN */
    PORT_SetPinConfig(BOARD_SMARTCARD_VCCEN_PORT, BOARD_SMARTCARD_VCCEN_PIN, &SMARTCARD_VCCEN);

    const port_pin_config_t SMARTCARD_PD = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as EMVSIM1_PD */
                                            kPORT_MuxAlt2,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTB7 (pin E11) is configured as EMVSIM1_PD */
    PORT_SetPinConfig(BOARD_SMARTCARD_PD_PORT, BOARD_SMARTCARD_PD_PIN, &SMARTCARD_PD);

    const port_pin_config_t SMARTCARD_RST = {/* Internal pull-up resistor is enabled */
                                             kPORT_PullUp,
                                             /* Fast slew rate is configured */
                                             kPORT_FastSlewRate,
                                             /* Passive filter is disabled */
                                             kPORT_PassiveFilterDisable,
                                             /* Open drain is disabled */
                                             kPORT_OpenDrainDisable,
                                             /* Pin is configured as EMVSIM1_RST */
                                             kPORT_MuxAlt2,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             kPORT_UnlockRegister};
    /* PORTB8 (pin D11) is configured as EMVSIM1_RST */
    PORT_SetPinConfig(BOARD_SMARTCARD_RST_PORT, BOARD_SMARTCARD_RST_PIN, &SMARTCARD_RST);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSBPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: H2, peripheral: USB0, signal: DP, pin_signal: USB0_DP}
  - {pin_num: H1, peripheral: USB0, signal: DM, pin_signal: USB0_DM}
  - {pin_num: J1, peripheral: USB0, signal: VDD, pin_signal: USB_VDD}
  - {pin_num: H11, peripheral: GPIOA, signal: 'GPIO, 29', pin_signal: PTA29, direction: INPUT, slew_rate: fast, open_drain: enable, pull_select: down, pull_enable: disable}
  - {pin_num: A4, peripheral: GPIOC, signal: 'GPIO, 19', pin_signal: PTC19, direction: OUTPUT, gpio_init_state: 'false', slew_rate: fast, open_drain: disable, pull_select: down,
    pull_enable: disable}
  - {pin_num: B4, peripheral: GPIOC, signal: 'GPIO, 18', pin_signal: PTC18, direction: INPUT, slew_rate: fast, open_drain: enable, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

