Masmiseim36/nxpSDK/boards/twrkl82z72m/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSBPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSBPins(void)
{
    /* PTA Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* PTC Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t USB_PWR_MON_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA29 (pin H11)  */
    GPIO_PinInit(BOARD_USB_PWR_MON_GPIO, BOARD_USB_PWR_MON_PIN, &USB_PWR_MON_config);

    gpio_pin_config_t USB_FLGA_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC18 (pin B4)  */
    GPIO_PinInit(BOARD_USB_FLGA_GPIO, BOARD_USB_FLGA_PIN, &USB_FLGA_config);

    gpio_pin_config_t USB_PWR_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC19 (pin A4)  */
    GPIO_PinInit(BOARD_USB_PWR_EN_GPIO, BOARD_USB_PWR_EN_PIN, &USB_PWR_EN_config);

    const port_pin_config_t USB_PWR_MON = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Fast slew rate is configured */
                                           kPORT_FastSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Open drain is enabled */
                                           kPORT_OpenDrainEnable,
                                           /* Pin is configured as PTA29 */
                                           kPORT_MuxAsGpio,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTA29 (pin H11) is configured as PTA29 */
    PORT_SetPinConfig(BOARD_USB_PWR_MON_PORT, BOARD_USB_PWR_MON_PIN, &USB_PWR_MON);

    const port_pin_config_t USB_FLGA = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain is enabled */
                                        kPORT_OpenDrainEnable,
                                        /* Pin is configured as PTC18 */
                                        kPORT_MuxAsGpio,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTC18 (pin B4) is configured as PTC18 */
    PORT_SetPinConfig(BOARD_USB_FLGA_PORT, BOARD_USB_FLGA_PIN, &USB_FLGA);

    const port_pin_config_t USB_PWR_EN = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Pin is configured as PTC19 */
                                          kPORT_MuxAsGpio,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTC19 (pin A4) is configured as PTC19 */
    PORT_SetPinConfig(BOARD_USB_PWR_EN_PORT, BOARD_USB_PWR_EN_PIN, &USB_PWR_EN);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
